app/controllers/songs_controller.rb

  def index

    if params[:artist_id]

      @artist = Artist.find_by(id: params[:artist_id])

      if @artist.nil?
      # binding.pry
      redirect_to artists_path, alert: "Artist not found"

      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    # binding.pry
    @song = Song.find_by(params[:id])
    # binding.pry
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      @song = @artist.songs.find_by(id: params[:id])
---
SELECT  "songs".* FROM "songs" WHERE (1) LIMIT ?  [["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 5], ["LIMIT", 1]]